<?php
/**
 * +----------------------------------------------------------------------
 * |@Category:		[数据库配置];								@version:1.0
 * +----------------------------------------------------------------------
 * |@Namespace:		[Common/Conf/];
 * +----------------------------------------------------------------------
 * |@Name:			[config_db.php];	
 * +----------------------------------------------------------------------
 * |@Filesource:	[ThinkPHP.@version(3.2.3)];		@PHP.@version:5.4.3	
 * +----------------------------------------------------------------------
 * |@License:(http://www.apache.org/licenses/LICENSE-2.0);@version:2.2.22
 * +----------------------------------------------------------------------
 * |@Copyright: (c) 2015-2016 (http://lishe.cn) All rights reserved;
 * +----------------------------------------------------------------------
 * |@Author:		lihongqiang				@StartTime:	2016-1-1 14:06
 * +----------------------------------------------------------------------
 * |@Email:		<lhq@lishe.cn>				@Overtime:	2016
 * +----------------------------------------------------------------------
 *  */
return array(

//----------------------------------------------------------------------------
//第一种：全局定义
//----------------------------------------------------------------------------

// 		//生产环境
// 		//'配置项'=>'配置值'
// 		'DB_TYPE'               =>  'mysql',                 		// 数据库类型
// 		'DB_HOST'               =>  '120.76.102.64',             	// 服务器地址
// 		'DB_NAME'               =>  'bbc',          				// 数据库名
// 		'DB_USER'               =>  'bbc',                  		// 用户名
// 		'DB_PWD'                =>  'bbc@1234',                		// 密码
// 		'DB_PORT'               =>  '3306',                  		// 端口
// 		'DB_CHARSET' 			=>  'utf8',							//编码格式
// 		'DB_PREFIX'             =>  '',               				// 数据库表前缀


// 		//App环境
// 		//'配置项'=>'配置值'
// 		'DB_TYPE'               =>  'mysql',                 		// 数据库类型
// 		'DB_HOST'               =>  '120.76.102.64',             	// 服务器地址
// 		'DB_NAME'               =>  'bbc_test',          			// 数据库名
// 		'DB_USER'               =>  'bbc_test',                  	// 用户名
// 		'DB_PWD'                =>  'bbc_test',                		// 密码
// 		'DB_PORT'               =>  '3306',                  		// 端口
// 		'DB_CHARSET' 			=>  'utf8',							//编码格式
// 		'DB_PREFIX'             =>  '',               				// 数据库表前缀
		
		
		//测试环境
		//'配置项'=>'配置值'
	    'DB_TYPE'   			=> 'mysql', 						// 数据库类型
	    'DB_HOST'   			=> '120.76.99.157', 				// 服务器地址
	    'DB_NAME'   			=> 'b2b2c', 						// 数据库名
	    'DB_USER'   			=> 'root', 							// 用户名
	    'DB_PWD'    			=> 'lishe_bbc@1234', 				// 密码
	    'DB_PORT'   			=> '3306', 							// 端口
	    'DB_CHARSET' 			=> 'utf8',							//编码格式
	    'DB_PREFIX'				=>''          						// 数据库表前缀


//----------------------------------------------------------------------------
//第二种：数组定义（可以灵活切换同一台服务器下的数据库）
//----------------------------------------------------------------------------

// 		////生产环境
// 		'DB_LISHE' => array(
// 				'DB_TYPE'               =>  'mysql',                 		// 数据库类型
// 				'DB_HOST'               =>  '120.76.102.64',             	// 服务器地址
// 				'DB_NAME'               =>  'bbc',          				// 数据库名
// 				'DB_USER'               =>  'bbc',                  		// 用户名
// 				'DB_PWD'                =>  'bbc@1234',                		// 密码
// 				'DB_PORT'               =>  '3306',                  		// 端口
// 				'DB_CHARSET' 			=>  'utf8',							//编码格式
// 				'DB_PREFIX'             =>  '',               				// 数据库表前缀
// 				'DB_DEBUG' 				=> TRUE,							//开启调试模式
// 		),
		
// 		////App环境
// 		'DB_LISHE_APP' => array(
// 				'DB_TYPE'               =>  'mysql',                 		// 数据库类型
// 				'DB_HOST'               =>  '120.76.102.64',             	// 服务器地址
// 				'DB_NAME'               =>  'bbc_test',          			// 数据库名
// 				'DB_USER'               =>  'bbc_test',                  	// 用户名
// 				'DB_PWD'                =>  'bbc_test',                		// 密码
// 				'DB_PORT'               =>  '3306',                  		// 端口
// 				'DB_CHARSET' 			=>  'utf8',							//编码格式
// 				'DB_PREFIX'             =>  '',               				// 数据库表前缀
// 				'DB_DEBUG' 				=> TRUE,							//开启调试模式
// 		),
		
// 		////测试环境
// 		'DB_LISHE_TEST' => array(
// 				'DB_TYPE'               =>  'mysql',                 		// 数据库类型
// 				'DB_HOST'               =>  '120.76.99.157',             	// 服务器地址
// 				'DB_NAME'               =>  'b2b2c',          				// 数据库名
// 				'DB_USER'               =>  'root',                  		// 用户名
// 				'DB_PWD'                =>  'lishe_bbc@1234',               // 密码
// 				'DB_PORT'               =>  '3306',                  		// 端口
// 				'DB_CHARSET' 			=>  'utf8',							//编码格式
// 				'DB_PREFIX'             =>  '',               				// 数据库表前缀
// 				'DB_DEBUG' 				=> TRUE,							//开启调试模式
// 		),
		
//----------------------------------------------------------------------------
//第三种：字符串定义（可以跨服务器调用切换数据库）
//----------------------------------------------------------------------------
// 		//测试环境
// 		'DB_LISHE' => 'mysql://root:lishe_bbc@1234@120.76.99.157:3306/b2b2c';


);