<?php
/**
 * +----------------------------------------------------------------------
 * |@Category:		[服务参数配置];								@version:1.0
 * +----------------------------------------------------------------------
 * |@Namespace:		[Common/Conf/];
 * +----------------------------------------------------------------------
 * |@Name:			[config_service.php];	
 * +----------------------------------------------------------------------
 * |@Filesource:	[ThinkPHP.@version(3.2.3)];		@PHP.@version:5.4.3	
 * +----------------------------------------------------------------------
 * |@License:(http://www.apache.org/licenses/LICENSE-2.0);@version:2.2.22
 * +----------------------------------------------------------------------
 * |@Copyright: (c) 2015-2016 (http://lishe.cn) All rights reserved;
 * +----------------------------------------------------------------------
 * |@Author:		lihongqiang				@StartTime:	2016-7-20 11:06
 * +----------------------------------------------------------------------
 * |@Email:		<lhq@lishe.cn>				@Overtime:	2016
 * +----------------------------------------------------------------------
 *  */
return array (
//'配置项'=>'配置值'
		'API_KEY'=>'lishe_md5_key_56e057f20f883e',//API Key
		'REDIS_HOST'=>"127.0.0.1",//redis 地址
		'REDIS_PORT'=>"6379",//redis 端口
		'SHOP_KEY' =>'lishe',//商铺的key
		'JD_SHOP_ID'=>'10',//京东商铺ID
		
		'DATA_STATUS' => array(
				0 => array('key' => 0, 'title' => '关闭'),
				1 => array('key' => 1, 'title' => '开启')
		),
		'LS_STATUS' => array(
				0 => array('key' => 0, 'title' => '关闭'),
				1 => array('key' => 1, 'title' => '开启')
		),
		'USER_ANONYMITY_NAME' =>	"匿名人",//匿名称呼
		
)
;