<?php

/**
 * +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 * @name:判断一串数字是不是手机号
 * @author: wh   2018-03-05
 * @param: int $PhoneNumber
 * @return:boolean
 * @example:
 * 移动：134、135、136、137、138、139、150、151、152、157、158、159、182、183、184、187、188、178(4G)、147(上网卡)；
 * 联通：130、131、132、155、156、185、186、176(4G)、145(上网卡)；
 * 电信：133、153、180、181、189 、177(4G)；
 * 卫星通信：1349
 * 虚拟运营商：170
 */
function isPhoneNumber($PhoneNumber) {
    if (!is_numeric($PhoneNumber)) {
        return false;
    }else{
        if(preg_match('#^13[\d]{9}$|^14[5,7]{1}\d{8}$|^15[^4]{1}\d{8}$|^17[0,6,7,8]{1}\d{8}$|^18[\d]{9}$#', $PhoneNumber)){
            return true;
        }else{
            return false;
        }
    }
}